export default {
  '1': { // 路由的key
    'name': '1-0-II常减压1', // 名称
    'group': '炼油板块',
    'gid': '1', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet1.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI1301': { 'x': 78, 'y': 443 },
      'TI1103': { 'x': 157, 'y': 269 },
      'TI1105': { 'x': 255, 'y': 164 },
      'PI1101': { 'x': 255, 'y': 194 },
      'TI1106': { 'x': 245, 'y': 363 },
      'FI6004': { 'x': 109, 'y': 160 },
      'TI1412': { 'x': 344, 'y': 451 },
      'PIC1401': { 'x': 489, 'y': 483 },
      'TI1111': { 'x': 498, 'y': 244 },
      'TIC1101': { 'x': 680, 'y': 89 },
      'PI1102': { 'x': 740, 'y': 89 },
      'TI1112': { 'x': 680, 'y': 413 },
      'PI1111': { 'x': 680, 'y': 444 },
      'TI6002': { 'x': 680, 'y': 117 },
      'TI6006': { 'x': 680, 'y': 144 },
      'FIC6002': { 'x': 740, 'y': 144 },
      'TI1120': { 'x': 680, 'y': 172 },
      'TI1121': { 'x': 680, 'y': 201 },
      'FIC1102': { 'x': 740, 'y': 201 },
      'TI1122': { 'x': 680, 'y': 273 },
      'TI1123': { 'x': 680, 'y': 304 },
      'FIC1103': { 'x': 740, 'y': 304 },
      'FIC1104': { 'x': 439, 'y': 121 },
      'FIC1105': { 'x': 885, 'y': 132 },
      'FIC1106': { 'x': 781, 'y': 232 },
      'FIC1107': { 'x': 885, 'y': 302 },
      'FI5115A': { 'x': 1002, 'y': 468 }
    }
  },
  '2': {
    'name': '1-0-II常减压2', // 名称
    'group': '炼油板块',
    'gid': '2', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet2.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'TI5017': { 'x': 0, 'y': 0 },
      'TIC5018': { 'x': 0, 'y': 0 },
      'PI5006': { 'x': 0, 'y': 0 },
      'TI5015': { 'x': 0, 'y': 0 },
      'FI5015': { 'x': 0, 'y': 0 },
      'PI5020': { 'x': 0, 'y': 0 },
      'TI5029': { 'x': 0, 'y': 0 },
      'TIC5039': { 'x': 0, 'y': 0 },
      'PI5009': { 'x': 0, 'y': 0 },
      'TI5028': { 'x': 0, 'y': 0 },
      'TI5037B': { 'x': 0, 'y': 0 },
      'TI5037A': { 'x': 0, 'y': 0 },
      'FIC5010': { 'x': 0, 'y': 0 },
      'FIC5013': { 'x': 0, 'y': 0 },
      'TI5035': { 'x': 0, 'y': 0 },
      'TI5034': { 'x': 0, 'y': 0 },
      'FIC5022': { 'x': 0, 'y': 0 },
      'TI5033': { 'x': 0, 'y': 0 },
      'TI5032': { 'x': 0, 'y': 0 },
      'FIC5024': { 'x': 0, 'y': 0 },
      'FI5019': { 'x': 0, 'y': 0 },
      'FI5020': { 'x': 0, 'y': 0 },
      'FI5021': { 'x': 0, 'y': 0 },
      'FI5023': { 'x': 0, 'y': 0 },
      'FI5025': { 'x': 0, 'y': 0 },
      'TI5110': { 'x': 0, 'y': 0 },
      'PI5102': { 'x': 0, 'y': 0 },
      'PI5103': { 'x': 0, 'y': 0 },
      'FI1208': { 'x': 0, 'y': 0 },
      'FI5104': { 'x': 0, 'y': 0 },
      'FI5108A': { 'x': 0, 'y': 0 },
      'FI5114A': { 'x': 0, 'y': 0 },
      'FI5117A': { 'x': 0, 'y': 0 }
    }
  },
  '3': {
    'name': '1-0-II常减压3', // 名称
    'group': '炼油板块',
    'gid': '3', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet3.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'TI8103': { 'x': 0, 'y': 0 },
      'TIC8101': { 'x': 0, 'y': 0 },
      'PI8102': { 'x': 0, 'y': 0 },
      'TI8105': { 'x': 0, 'y': 0 },
      'FI8101': { 'x': 0, 'y': 0 },
      'TI8411': { 'x': 0, 'y': 0 },
      'TIC8416': { 'x': 0, 'y': 0 },
      'PI8401': { 'x': 0, 'y': 0 },
      'TI8410': { 'x': 0, 'y': 0 },
      'PI3003C': { 'x': 0, 'y': 0 },
      'TI8406': { 'x': 0, 'y': 0 },
      'TI8405': { 'x': 0, 'y': 0 },
      'FIC8403': { 'x': 0, 'y': 0 },
      'TT8404': { 'x': 0, 'y': 0 },
      'TT8403': { 'x': 0, 'y': 0 },
      'FIC8402': { 'x': 0, 'y': 0 },
      'TT8402': { 'x': 0, 'y': 0 },
      'TT8401': { 'x': 0, 'y': 0 },
      'FIC8401': { 'x': 0, 'y': 0 },
      'FI8408': { 'x': 0, 'y': 0 },
      'FIC9301': { 'x': 0, 'y': 0 },
      'FIC9302': { 'x': 0, 'y': 0 },
      'FIC9303': { 'x': 0, 'y': 0 },
      'TI8711': { 'x': 0, 'y': 0 },
      'PI8708': { 'x': 0, 'y': 0 },
      'PI8702': { 'x': 0, 'y': 0 },
      'FI8751': { 'x': 0, 'y': 0 },
      'FI9311': { 'x': 0, 'y': 0 },
      'FIC9312': { 'x': 0, 'y': 0 },
      'FIC9313': { 'x': 0, 'y': 0 },
      'FT9318': { 'x': 0, 'y': 0 },
      'FIC9316': { 'x': 0, 'y': 0 }
    }
  },
  '4': {
    'name': '1#中压加氢裂化', // TODO:名称
    'group': '炼油板块',
    'gid': '4', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet4.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC6101': { 'x': 0, 'y': 0 },
      'FIC6102': { 'x': 0, 'y': 0 },
      'TI6141A': { 'x': 0, 'y': 0 },
      'TI6143A': { 'x': 0, 'y': 0 },
      'TI6145A': { 'x': 0, 'y': 0 },
      'TI6157A': { 'x': 0, 'y': 0 },
      'TI6159A': { 'x': 0, 'y': 0 },
      'TI6161A': { 'x': 0, 'y': 0 },
      'PI6111': { 'x': 0, 'y': 0 },
      'PI6112': { 'x': 0, 'y': 0 },
      'PI6115': { 'x': 0, 'y': 0 },
      'PI6116': { 'x': 0, 'y': 0 },
      'FI6204': { 'x': 0, 'y': 0 },
      'FI6205': { 'x': 0, 'y': 0 },
      'FT6239': { 'x': 0, 'y': 0 },
      'FIC6234': { 'x': 0, 'y': 0 },
      'FIC6245': { 'x': 0, 'y': 0 },
      'FIC6232': { 'x': 0, 'y': 0 },
      'FT6238': { 'x': 0, 'y': 0 }
    }
  },
  '5': {
    'name': '1-1-II加氢裂化', // 名称
    'group': '炼油板块',
    'gid': '5', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet5.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI1802': { 'x': 0, 'y': 0 },
      'FI1801': { 'x': 0, 'y': 0 },
      'FI1804': { 'x': 0, 'y': 0 },
      'FI1803': { 'x': 0, 'y': 0 },
      'TI1041': { 'x': 0, 'y': 0 },
      'TI1052': { 'x': 0, 'y': 0 },
      'TI1807': { 'x': 0, 'y': 0 },
      'TI1819': { 'x': 0, 'y': 0 },
      'TI1073': { 'x': 0, 'y': 0 },
      'TI1080': { 'x': 0, 'y': 0 },
      'TI1087': { 'x': 0, 'y': 0 },
      'TI1094': { 'x': 0, 'y': 0 },
      'PI1010': { 'x': 0, 'y': 0 },
      'PI1011': { 'x': 0, 'y': 0 },
      'PI1802': { 'x': 0, 'y': 0 },
      'PI1804': { 'x': 0, 'y': 0 },
      'PI1019': { 'x': 0, 'y': 0 },
      'PI1020': { 'x': 0, 'y': 0 },
      'FI1040': { 'x': 0, 'y': 0 },
      'FI1026': { 'x': 0, 'y': 0 },
      'FI1038': { 'x': 0, 'y': 0 },
      'FI1060': { 'x': 0, 'y': 0 },
      'FI1057': { 'x': 0, 'y': 0 },
      'FIQ1708': { 'x': 0, 'y': 0 },
      'FCQ1716': { 'x': 0, 'y': 0 },
      'FI1809': { 'x': 0, 'y': 0 }
    }
  },
  '6': { // 路由的key
    'name': '1-2-重油催化裂化装置', // 名称
    'group': '炼油板块',
    'gid': '6', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet6.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'TI20102': { 'x': 558, 'y': 146 },
      'PI10303A': { 'x': 137, 'y': 260 },
      'TI30202': { 'x': 718, 'y': 170 },
      'TI30305': { 'x': 1032, 'y': 110 },
      'TI30320': { 'x': 1052, 'y': 471 },
      'TI30213': { 'x': 727, 'y': 470 },
      'TI20125': { 'x': 553, 'y': 467 },
      'FI20202': { 'x': 205, 'y': 495 },
      'TIC20901': { 'x': 245, 'y': 449 },
      'FI10307': { 'x': 189, 'y': 424 },
      'TI10208': { 'x': 483, 'y': 369 },
      'PI350202': { 'x': 384, 'y': 149 }
    }
  },
  '7': {
    'name': '1-3-I延迟焦化', // 名称
    'group': '炼油板块',
    'gid': '7', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet7.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIQ1154': { 'x': 0, 'y': 0 },
      'FI9306': { 'x': 0, 'y': 0 },
      'FIQ1172': { 'x': 0, 'y': 0 },
      'FIC1116A': { 'x': 0, 'y': 0 },
      'FIQ1173': { 'x': 0, 'y': 0 },
      'FIQ1170': { 'x': 0, 'y': 0 },
      'TIC1102': { 'x': 0, 'y': 0 },
      'TIC1103': { 'x': 0, 'y': 0 },
      'PI1128': { 'x': 0, 'y': 0 },
      'PI1129': { 'x': 0, 'y': 0 }
    }
  },
  '8': {
    'name': '1-3-II延迟焦化', // 名称
    'group': '炼油板块',
    'gid': '8', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet8.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'TI9003': { 'x': 0, 'y': 0 },
      'PI9116B': { 'x': 0, 'y': 0 },
      'PI9116A': { 'x': 0, 'y': 0 },
      'FI9120': { 'x': 0, 'y': 0 },
      'FI9306': { 'x': 0, 'y': 0 },
      'FI9121B': { 'x': 0, 'y': 0 },
      'FI9123': { 'x': 0, 'y': 0 },
      'FI9124': { 'x': 0, 'y': 0 },
      'FIC9102': { 'x': 0, 'y': 0 }
    }
  },
  '9': {
    'name': '1-4-渣油加氢装置', // 名称
    'group': '炼油板块',
    'gid': '9', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet9.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'TI11306': { 'x': 0, 'y': 0 },
      'PI11401': { 'x': 0, 'y': 0 },
      'FIC11501': { 'x': 0, 'y': 0 },
      'TI11502': { 'x': 0, 'y': 0 },
      'PI11501': { 'x': 0, 'y': 0 },
      'FIC11601': { 'x': 0, 'y': 0 },
      'TI11602': { 'x': 0, 'y': 0 },
      'PI11601': { 'x': 0, 'y': 0 },
      'FIC11701': { 'x': 0, 'y': 0 },
      'TI11702': { 'x': 0, 'y': 0 },
      'PI11701': { 'x': 0, 'y': 0 },
      'FIC11801': { 'x': 0, 'y': 0 },
      'TI11802': { 'x': 0, 'y': 0 },
      'PI11801': { 'x': 0, 'y': 0 },
      'PIC12202': { 'x': 0, 'y': 0 },
      'TI81306': { 'x': 0, 'y': 0 },
      'PI81401': { 'x': 0, 'y': 0 },
      'FIC81501': { 'x': 0, 'y': 0 },
      'TI81502': { 'x': 0, 'y': 0 },
      'PI81501': { 'x': 0, 'y': 0 },
      'TI81602': { 'x': 0, 'y': 0 },
      'FIC81601': { 'x': 0, 'y': 0 },
      'PI81601': { 'x': 0, 'y': 0 },
      'TI81702': { 'x': 0, 'y': 0 },
      'FIC81701': { 'x': 0, 'y': 0 },
      'TI81802': { 'x': 0, 'y': 0 },
      'FIC81801': { 'x': 0, 'y': 0 },
      'PI81801': { 'x': 0, 'y': 0 },
      'PIC82202': { 'x': 0, 'y': 0 },
      'FI20201': { 'x': 0, 'y': 0 },
      'FI20804': { 'x': 0, 'y': 0 },
      'FI82501': { 'x': 0, 'y': 0 },
      'FI12501': { 'x': 0, 'y': 0 },
      'FIC11102': { 'x': 0, 'y': 0 },
      'FIQ30203': { 'x': 0, 'y': 0 },
      'FIC20203': { 'x': 0, 'y': 0 },
      'FIQ21201': { 'x': 0, 'y': 0 },
      'FIQ20802': { 'x': 0, 'y': 0 },
      'FIC21001': { 'x': 0, 'y': 0 },
      'FI21003': { 'x': 0, 'y': 0 }
    }
  },
  '10': {
    'name': '1-5-航煤加氢选择性加氢', // 名称
    'group': '炼油板块',
    'gid': '10', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet10.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC7102': { 'x': 0, 'y': 0 },
      'FT7301': { 'x': 0, 'y': 0 },
      'TIC7101': { 'x': 0, 'y': 0 },
      'PI7103': { 'x': 0, 'y': 0 },
      'FI7206': { 'x': 0, 'y': 0 },
      'FIQ7207': { 'x': 0, 'y': 0 },
      'FIQ7104': { 'x': 0, 'y': 0 },
      'FIC7205': { 'x': 0, 'y': 0 },
      'TI7122': { 'x': 0, 'y': 0 },
      'TI7127': { 'x': 0, 'y': 0 },
      'FIQ7302': { 'x': 0, 'y': 0 },
      'FIC6002': { 'x': 0, 'y': 0 },
      'FT6009': { 'x': 0, 'y': 0 },
      'FI6010': { 'x': 0, 'y': 0 },
      'TI6004': { 'x': 0, 'y': 0 },
      'PI6001': { 'x': 0, 'y': 0 },
      'TIC6015': { 'x': 0, 'y': 0 },
      'TIC6020': { 'x': 0, 'y': 0 },
      'TI6009': { 'x': 0, 'y': 0 },
      'FT6017': { 'x': 0, 'y': 0 },
      'FIC6015': { 'x': 0, 'y': 0 },
      'FIC6014': { 'x': 0, 'y': 0 },
      'FIC6016': { 'x': 0, 'y': 0 },
      'PIC6008': { 'x': 0, 'y': 0 },
      'TT6026': { 'x': 0, 'y': 0 }
    }
  },
  '11': {
    'name': '1-6-SZorb', // 名称
    'group': '炼油板块',
    'gid': '11', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet11.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI1001': { 'x': 0, 'y': 0 },
      'FIC1102': { 'x': 0, 'y': 0 },
      'TIC1606': { 'x': 0, 'y': 0 },
      'PI2101': { 'x': 0, 'y': 0 },
      'TI1002': { 'x': 0, 'y': 0 },
      'FI5101': { 'x': 0, 'y': 0 },
      'FIC5202': { 'x': 0, 'y': 0 },
      'PIC1301': { 'x': 0, 'y': 0 },
      'TI1203': { 'x': 0, 'y': 0 }
    }
  },
  '12': {
    'name': '1-7-I柴油加氢', // 名称
    'group': '炼油板块',
    'gid': '12', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet12.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI9101': { 'x': 0, 'y': 0 },
      'TI4019A': { 'x': 0, 'y': 0 },
      'TI4021A': { 'x': 0, 'y': 0 },
      'FI4026': { 'x': 0, 'y': 0 },
      'FI4023': { 'x': 0, 'y': 0 },
      'FIC4006': { 'x': 0, 'y': 0 }
    }
  },
  '13': {
    'name': '1-7-III柴油加氢精制', // 名称
    'group': '炼油板块',
    'gid': '13', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet13.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI2102': { 'x': 0, 'y': 0 },
      'FIC2101': { 'x': 0, 'y': 0 },
      'FI2104': { 'x': 0, 'y': 0 },
      'TI2128A': { 'x': 0, 'y': 0 },
      'TI2130A': { 'x': 0, 'y': 0 },
      'TI2170': { 'x': 0, 'y': 0 },
      'FI2210': { 'x': 0, 'y': 0 },
      'FI2212': { 'x': 0, 'y': 0 },
      'FI2306': { 'x': 0, 'y': 0 },
      'FI2304': { 'x': 0, 'y': 0 }
    }
  },
  '14': {
    'name': '1-8-加氢改制', // 名称
    'group': '炼油板块',
    'gid': '14', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet14.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC4100S': { 'x': 0, 'y': 0 },
      'FI4201': { 'x': 0, 'y': 0 },
      'TIC4110': { 'x': 0, 'y': 0 },
      'TIC4142B': { 'x': 0, 'y': 0 },
      'PI4119': { 'x': 0, 'y': 0 },
      'TIC4150': { 'x': 0, 'y': 0 },
      'TIC4152': { 'x': 0, 'y': 0 },
      'TIC4153': { 'x': 0, 'y': 0 },
      'TIC4154': { 'x': 0, 'y': 0 },
      'TIC4155': { 'x': 0, 'y': 0 },
      'FI4322': { 'x': 0, 'y': 0 },
      'FI4375': { 'x': 0, 'y': 0 },
      'FT4371': { 'x': 0, 'y': 0 },
      'FIC4382': { 'x': 0, 'y': 0 },
      'FIC4392': { 'x': 0, 'y': 0 },
      'FT4300': { 'x': 0, 'y': 0 },
      'FIC4321': { 'x': 0, 'y': 0 },
      'TI4376': { 'x': 0, 'y': 0 }
    }
  },
  '15': {
    'name': '1-9-I制氢装置', // 名称
    'group': '炼油板块',
    'gid': '15', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet15.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI10101': { 'x': 0, 'y': 0 },
      'TI10103': { 'x': 0, 'y': 0 },
      'TI10104': { 'x': 0, 'y': 0 },
      'TI10105': { 'x': 0, 'y': 0 },
      'TI10115': { 'x': 0, 'y': 0 },
      'PI10116': { 'x': 0, 'y': 0 },
      'FI10107': { 'x': 0, 'y': 0 },
      'TI10119': { 'x': 0, 'y': 0 },
      'TI10121': { 'x': 0, 'y': 0 },
      'TI10134': { 'x': 0, 'y': 0 },
      'PI10111': { 'x': 0, 'y': 0 },
      'TI10136': { 'x': 0, 'y': 0 },
      'TI10203': { 'x': 0, 'y': 0 },
      'TI10204': { 'x': 0, 'y': 0 },
      'FI10105': { 'x': 0, 'y': 0 },
      'TI10205': { 'x': 0, 'y': 0 },
      'TI10215': { 'x': 0, 'y': 0 },
      'PI10216': { 'x': 0, 'y': 0 },
      'FI10207': { 'x': 0, 'y': 0 },
      'TI10219': { 'x': 0, 'y': 0 },
      'TI10221': { 'x': 0, 'y': 0 },
      'TI10234': { 'x': 0, 'y': 0 },
      'PI10211': { 'x': 0, 'y': 0 },
      'TI10236': { 'x': 0, 'y': 0 },
      'FI10205': { 'x': 0, 'y': 0 }
    }
  },
  '16': {
    'name': '1-9-II III制氢模型', // 名称
    'group': '炼油板块',
    'gid': '16', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet16.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIQ5102': { 'x': 0, 'y': 0 },
      'TI5105': { 'x': 0, 'y': 0 },
      'TI5114': { 'x': 0, 'y': 0 },
      'FIC5106': { 'x': 0, 'y': 0 },
      'PI5408': { 'x': 0, 'y': 0 },
      'PI5404': { 'x': 0, 'y': 0 },
      'TI5402A': { 'x': 0, 'y': 0 },
      'PI5201': { 'x': 0, 'y': 0 },
      'TI5210': { 'x': 0, 'y': 0 },
      'TIC5129B': { 'x': 0, 'y': 0 },
      'FI10252': { 'x': 0, 'y': 0 },
      'PI20301': { 'x': 0, 'y': 0 },
      'TI20304': { 'x': 0, 'y': 0 },
      'TI20307': { 'x': 0, 'y': 0 },
      'PI20401': { 'x': 0, 'y': 0 },
      'TI20401': { 'x': 0, 'y': 0 },
      'FC20402': { 'x': 0, 'y': 0 },
      'PI20502': { 'x': 0, 'y': 0 },
      'TC20505': { 'x': 0, 'y': 0 },
      'PI20601': { 'x': 0, 'y': 0 },
      'TI20603': { 'x': 0, 'y': 0 },
      'PI20602': { 'x': 0, 'y': 0 },
      'TI20301': { 'x': 0, 'y': 0 },
      'WTT20535': { 'x': 0, 'y': 0 }
    }
  },
  '17': {
    'name': '1-I甲基叔丁基醚装置', // 名称
    'group': '炼油板块',
    'gid': '17', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet17.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FRC102': { 'x': 0, 'y': 0 },
      'FRC101': { 'x': 0, 'y': 0 },
      'FR111': { 'x': 0, 'y': 0 },
      'FR112': { 'x': 0, 'y': 0 },
      'FR113': { 'x': 0, 'y': 0 },
      'TI133': { 'x': 0, 'y': 0 },
      'FR117': { 'x': 0, 'y': 0 },
      'TIC110': { 'x': 0, 'y': 0 },
      'FIQ116': { 'x': 0, 'y': 0 }
    }
  },
  '18': {
    'name': '1-II甲基叔丁基醚装置', // 名称
    'group': '炼油板块',
    'gid': '18', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet18.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC350102': { 'x': 0, 'y': 0 },
      'FIC350103': { 'x': 0, 'y': 0 },
      'FIC350204': { 'x': 0, 'y': 0 },
      'FIC350205': { 'x': 0, 'y': 0 },
      'TI350559': { 'x': 0, 'y': 0 },
      'TI350344': { 'x': 0, 'y': 0 },
      'FIC350529': { 'x': 0, 'y': 0 },
      'TI350664': { 'x': 0, 'y': 0 },
      'FIQ350323': { 'x': 0, 'y': 0 },
      'FIC350527': { 'x': 0, 'y': 0 }
    }
  },
  '19': {
    'name': '1-溶剂脱沥青装置', // 名称
    'group': '炼油板块',
    'gid': '19', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet19.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
    }
  },
  '20': {
    'name': '2-0-I重整装置', // 名称
    'group': '化工板块',
    'gid': '20', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet20.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI3010': { 'x': 0, 'y': 0 },
      'TI3202': { 'x': 0, 'y': 0 },
      'TI3009': { 'x': 0, 'y': 0 },
      'TI3016': { 'x': 0, 'y': 0 },
      'TI3012': { 'x': 0, 'y': 0 },
      'FI3060': { 'x': 0, 'y': 0 },
      'PI3014': { 'x': 0, 'y': 0 },
      'PI3008': { 'x': 0, 'y': 0 },
      'TI3037': { 'x': 0, 'y': 0 },
      'TI3047': { 'x': 0, 'y': 0 },
      'FI3013': { 'x': 0, 'y': 0 },
      'FI3021': { 'x': 0, 'y': 0 },
      'FC3023': { 'x': 0, 'y': 0 },
      'FI3034': { 'x': 0, 'y': 0 },
      'FC3210': { 'x': 0, 'y': 0 },
      'TI3004': { 'x': 0, 'y': 0 },
      'TI3007': { 'x': 0, 'y': 0 },
      'TI3010': { 'x': 0, 'y': 0 },
      'TI3013': { 'x': 0, 'y': 0 },
      'FI3020': { 'x': 0, 'y': 0 }
    }
  },
  '21': {
    'name': '2-0-II重整装置', // 名称
    'group': '化工板块',
    'gid': '21', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet21.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FC21101': { 'x': 0, 'y': 0 },
      'TI20603': { 'x': 0, 'y': 0 },
      'TI20703': { 'x': 0, 'y': 0 },
      'TI20803': { 'x': 0, 'y': 0 },
      'TI20903': { 'x': 0, 'y': 0 },
      'FI21102C': { 'x': 0, 'y': 0 },
      'TI22102': { 'x': 0, 'y': 0 },
      'TI22405': { 'x': 0, 'y': 0 },
      'FI21901': { 'x': 0, 'y': 0 },
      'FI22301': { 'x': 0, 'y': 0 },
      'FC22504': { 'x': 0, 'y': 0 },
      'FI22402': { 'x': 0, 'y': 0 },
      'FC22001': { 'x': 0, 'y': 0 },
      'TI21001': { 'x': 0, 'y': 0 },
      'TI21002': { 'x': 0, 'y': 0 },
      'TI21003': { 'x': 0, 'y': 0 },
      'TI21004': { 'x': 0, 'y': 0 },
      'PC3048': { 'x': 0, 'y': 0 },
      'PC21301': { 'x': 0, 'y': 0 }
    }
  },
  '22': { // 路由的key
    'name': '2-0-III重整装置', // 名称
    'group': '化工板块',
    'gid': '22', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet22.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FC320601': { 'x': 223, 'y': 107 },
      'TI320101A': { 'x': 131, 'y': 305 },
      'TI320201A': { 'x': 213, 'y': 305 },
      'TI320301A': { 'x': 322, 'y': 305 },
      'TI320401A': { 'x': 437, 'y': 305 },
      'FI320602A': { 'x': 559, 'y': 305 },
      'PC321301': { 'x': 732, 'y': 112 },
      'PC320801': { 'x': 640, 'y': 290 },
      'TC321703': { 'x': 782, 'y': 337 },
      'TI322005': { 'x': 1037, 'y': 317 },
      'TI322302': { 'x': 889, 'y': 499 },
      'FI321401': { 'x': 998, 'y': 153 },
      'FI321901': { 'x': 1062, 'y': 172 },
      'FC322104': { 'x': 1097, 'y': 258 },
      'FIQ322002': { 'x': 1054, 'y': 364 },
      'FC322402': { 'x': 1055, 'y': 448 },
      'FC322301': { 'x': 1055, 'y': 563 },
      'TI320501': { 'x': 88, 'y': 421 },
      'TI320502': { 'x': 181, 'y': 421 },
      'TI320503': { 'x': 398, 'y': 421 },
      'TI320504': { 'x': 280, 'y': 421 }
    }
  },
  '23': {
    'name': '2-1-石油脑预加氢', // 名称
    'group': '化工板块',
    'gid': '23', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet23.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
    }
  },
  '24': {
    'name': '2-2-乙烯装置', // 名称
    'group': '化工板块',
    'gid': '24', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet24.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      '中压加氢': { 'x': 238, 'y': 104 },
      '高压加氢': { 'x': 238, 'y': 186 },
      '石脑油': { 'x': 238, 'y': 273 },
      '轻石脑油': { 'x': 238, 'y': 365 },
      'LPG': { 'x': 238, 'y': 446 },
      '氢气': { 'x': 1007, 'y': 119 },
      '甲烷': { 'x': 1007, 'y': 187 },
      '乙烯': { 'x': 1007, 'y': 257 },
      '丙烯': { 'x': 1007, 'y': 327 }
    }
  },
  '25': {
    'name': '2-3-II IV裂解汽油加氢', // 名称
    'group': '化工板块',
    'gid': '25', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet25.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
    }
  },
  '26': {
    'name': '2-4-歧化装置', // 名称
    'group': '化工板块',
    'gid': '26', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet26.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIQ50801': { 'x': 0, 'y': 0 },
      'FIQ50603': { 'x': 0, 'y': 0 },
      'FIQ51003': { 'x': 0, 'y': 0 },
      'FC51002': { 'x': 0, 'y': 0 },
      'FC55501': { 'x': 0, 'y': 0 },
      'FC51001': { 'x': 0, 'y': 0 },
      'TI50904': { 'x': 0, 'y': 0 },
      'FI50301A': { 'x': 0, 'y': 0 },
      'TC50401': { 'x': 0, 'y': 0 },
      'TI50405': { 'x': 0, 'y': 0 },
      'PI50501': { 'x': 0, 'y': 0 },
      'PDI50503': { 'x': 0, 'y': 0 },
      'FC55401': { 'x': 0, 'y': 0 },
      'TI55305': { 'x': 0, 'y': 0 },
      'FC55802': { 'x': 0, 'y': 0 },
      'FC55801': { 'x': 0, 'y': 0 },
      'TI55605': { 'x': 0, 'y': 0 },
      'FC55601': { 'x': 0, 'y': 0 },
      'FC50203A': { 'x': 0, 'y': 0 }
    }
  },
  '27': {
    'name': '2-5-异构化装置', // 名称
    'group': '化工板块',
    'gid': '27', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet27.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FC70701': { 'x': 0, 'y': 0 },
      'FI71002': { 'x': 0, 'y': 0 },
      'TC70503': { 'x': 0, 'y': 0 },
      'PI70601': { 'x': 0, 'y': 0 },
      'FI71503': { 'x': 0, 'y': 0 },
      'FC71502': { 'x': 0, 'y': 0 },
      'FC71102': { 'x': 0, 'y': 0 },
      'TI70703': { 'x': 0, 'y': 0 },
      'TI70601': { 'x': 0, 'y': 0 },
      'PC71801': { 'x': 0, 'y': 0 },
      'TI71302': { 'x': 0, 'y': 0 },
      'TDC62003': { 'x': 0, 'y': 0 },
      'TDC61403': { 'x': 0, 'y': 0 },
      'FT60804': { 'x': 0, 'y': 0 },
      'TC62306': { 'x': 0, 'y': 0 },
      'FI70702A': { 'x': 0, 'y': 0 },
      'FI61801A': { 'x': 0, 'y': 0 },
      'FI60601': { 'x': 0, 'y': 0 },
      'FC81503': { 'x': 0, 'y': 0 },
      'FC62401': { 'x': 0, 'y': 0 },
      'FC62103': { 'x': 0, 'y': 0 },
      'FI62201': { 'x': 0, 'y': 0 }
    }
  },
  '28': {
    'name': '2-6-I乙二醇', // 名称
    'group': '化工板块',
    'gid': '28', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet28.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FR161': { 'x': 0, 'y': 0 },
      'PI172': { 'x': 0, 'y': 0 },
      'TR122': { 'x': 0, 'y': 0 },
      'FR162': { 'x': 0, 'y': 0 },
      'FR1501': { 'x': 0, 'y': 0 },
      'TR1322': { 'x': 0, 'y': 0 },
      'TRC502': { 'x': 0, 'y': 0 },
      'TJR10407': { 'x': 0, 'y': 0 },
      'TJR10436': { 'x': 0, 'y': 0 },
      'TI1161': { 'x': 0, 'y': 0 },
      'TJI50016': { 'x': 0, 'y': 0 },
      'PRC511': { 'x': 0, 'y': 0 },
      'TR127': { 'x': 0, 'y': 0 }
    }
  },
  '29': {
    'name': '2-6-II乙二醇', // 名称
    'group': '化工板块',
    'gid': '29', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet29.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FI1511': { 'x': 0, 'y': 0 },
      'PI1840': { 'x': 0, 'y': 0 },
      'TI1136': { 'x': 0, 'y': 0 },
      'FI1521': { 'x': 0, 'y': 0 },
      'TI1236': { 'x': 0, 'y': 0 },
      'TIC5305': { 'x': 0, 'y': 0 },
      'TIA1160': { 'x': 0, 'y': 0 },
      'TIA1260': { 'x': 0, 'y': 0 },
      'TI5304B': { 'x': 0, 'y': 0 },
      'PIC5511': { 'x': 0, 'y': 0 }
    }
  },
  '30': {
    'name': '2-7-醋酸乙烯装置  ', // 名称
    'group': '塑料板块',
    'gid': '30', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet30.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
    }
  },
  '31': {
    'name': 'PVA_A系列和B系列', // TODO:名称
    'group': '塑料板块',
    'gid': '31', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet31.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
    }
  },
  '32': {
    'name': '2-9-乙氧基化装置', // 名称
    'group': '塑料板块',
    'gid': '32', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet32.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'PT105': { 'x': 0, 'y': 0 },
      'TE102': { 'x': 0, 'y': 0 },
      'FT101': { 'x': 0, 'y': 0 }
    }
  },
  '33': { // 路由的key
    'name': '3-0-I聚乙烯装置1', // 名称
    'group': '塑料板块',
    'gid': '33', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet33.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      '1FT_101': { 'x': 120, 'y': 213 },
      '1FICA353': { 'x': 269, 'y': 401 },
      '1FT_352': { 'x': 378, 'y': 401 },
      '1FICA901': { 'x': 457, 'y': 197 },
      '1FICA902': { 'x': 739, 'y': 207 },
      '1PT_155_K1': { 'x': 621, 'y': 326 },
      '1PT_156': { 'x': 911, 'y': 326 },
      '1TICA2A': { 'x': 596, 'y': 172 },
      '1TICA2B': { 'x': 881, 'y': 181 },
      '1TI_1015': { 'x': 257, 'y': 197 },
      '1TI_1601': { 'x': 298, 'y': 292 },
      '1TI_1511': { 'x': 386, 'y': 292 },
      '1TI_301': { 'x': 910, 'y': 398 },
      '1PT_212': { 'x': 888, 'y': 552 },
      '1PT_301': { 'x': 884, 'y': 456 },
      '1M_401': { 'x': 1019, 'y': 542 },
      '1TE_296': { 'x': 910, 'y': 494 },
      '1TI_1012': { 'x': 355, 'y': 197 }
    }
  },
  '34': {
    'name': '3-0-I聚乙烯装置2', // 名称
    'group': '塑料板块',
    'gid': '34', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet34.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      '2FT_101': { 'x': 0, 'y': 0 },
      '2FICA353': { 'x': 0, 'y': 0 },
      '2FT_352': { 'x': 0, 'y': 0 },
      '2FICA901': { 'x': 0, 'y': 0 },
      '2FICA902': { 'x': 0, 'y': 0 },
      '2FICA921': { 'x': 0, 'y': 0 },
      '2PT_155': { 'x': 0, 'y': 0 },
      '2PT_156': { 'x': 0, 'y': 0 },
      '2TICA2A': { 'x': 0, 'y': 0 },
      '2TICA2B': { 'x': 0, 'y': 0 },
      '2TI_1015': { 'x': 0, 'y': 0 },
      '2TI_1012': { 'x': 0, 'y': 0 },
      '2TI_1601': { 'x': 0, 'y': 0 },
      '2TI_1511': { 'x': 0, 'y': 0 },
      '2PT_212': { 'x': 0, 'y': 0 },
      '2TE_296': { 'x': 0, 'y': 0 },
      '2PT_301': { 'x': 0, 'y': 0 },
      '2TI_301': { 'x': 0, 'y': 0 },
      '2M_401': { 'x': 0, 'y': 0 }
    }
  },
  '35': {
    'name': '3-0-II聚乙烯装置', // 名称
    'group': '塑料板块',
    'gid': '35', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet35.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FC101': { 'x': 0, 'y': 0 },
      'FC951': { 'x': 0, 'y': 0 },
      'FC926': { 'x': 0, 'y': 0 },
      'FC925': { 'x': 0, 'y': 0 },
      'FI102': { 'x': 0, 'y': 0 },
      'FI150': { 'x': 0, 'y': 0 },
      'FC901': { 'x': 0, 'y': 0 },
      'FC902': { 'x': 0, 'y': 0 },
      'FC904': { 'x': 0, 'y': 0 },
      'TC105': { 'x': 0, 'y': 0 },
      'PC110': { 'x': 0, 'y': 0 },
      'TC153': { 'x': 0, 'y': 0 },
      'PI152A': { 'x': 0, 'y': 0 },
      'TC235A': { 'x': 0, 'y': 0 },
      'TC281': { 'x': 0, 'y': 0 },
      'TC231B': { 'x': 0, 'y': 0 },
      'TC282': { 'x': 0, 'y': 0 },
      'TI253B': { 'x': 0, 'y': 0 },
      'PC156': { 'x': 0, 'y': 0 },
      'PC253': { 'x': 0, 'y': 0 },
      'TI342': { 'x': 0, 'y': 0 },
      'PI206': { 'x': 0, 'y': 0 },
      'TI331': { 'x': 0, 'y': 0 },
      'AI501': { 'x': 0, 'y': 0 },
      'FC973': { 'x': 0, 'y': 0 }
    }
  },
  '36': {
    'name': '3-0-IV聚乙烯装置', // 名称
    'group': '塑料板块',
    'gid': '36', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet36.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'H3058_K1': { 'x': 0, 'y': 0 },
      'FIC3006': { 'x': 0, 'y': 0 },
      'FIC3026B': { 'x': 0, 'y': 0 },
      'FIC4008B': { 'x': 0, 'y': 0 },
      'FIC3005': { 'x': 0, 'y': 0 },
      'FIC3008': { 'x': 0, 'y': 0 },
      'FIC3023': { 'x': 0, 'y': 0 },
      'FIC3027': { 'x': 0, 'y': 0 },
      'FIC4006': { 'x': 0, 'y': 0 },
      'FIC4009B': { 'x': 0, 'y': 0 },
      'FIC4027A': { 'x': 0, 'y': 0 },
      'TIC3009': { 'x': 0, 'y': 0 },
      'TI3042': { 'x': 0, 'y': 0 },
      'TIC4059': { 'x': 0, 'y': 0 },
      'PIA3017': { 'x': 0, 'y': 0 },
      'PIA3031': { 'x': 0, 'y': 0 },
      'XI4892': { 'x': 0, 'y': 0 }
    }
  },
  '37': {
    'name': '3-1-I聚丙烯', // 名称
    'group': '塑料板块',
    'gid': '37', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet37.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      '1FCDA111': { 'x': 227, 'y': 103 },
      '1FCA201B': { 'x': 346, 'y': 330 },
      '1FCA202B': { 'x': 344, 'y': 474 },
      '1FCDA204': { 'x': 311, 'y': 257 },
      '1FCDA203': { 'x': 370, 'y': 397 },
      '1FCDA233': { 'x': 370, 'y': 363 },
      '1FCDA231': { 'x': 373, 'y': 510 },
      '1FCDA234': { 'x': 373, 'y': 539 },
      '1TCDA221': { 'x': 543, 'y': 215 },
      '1TCDA241': { 'x': 764, 'y': 371 },
      '1TCDA251': { 'x': 774, 'y': 550 },
      '1PRA221': { 'x': 468, 'y': 134 },
      '1PRCA241': { 'x': 645, 'y': 257 },
      '1PRCA251': { 'x': 651, 'y': 430 },
      '1FI0042': { 'x': 1085, 'y': 494 }
    }
  },
  '38': {
    'name': '3-1-II聚丙烯', // 名称
    'group': '塑料板块',
    'gid': '38', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet38.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      '2FCDA111': { 'x': 0, 'y': 0 },
      '2FCA201B': { 'x': 0, 'y': 0 },
      '2FCA202B': { 'x': 0, 'y': 0 },
      '2FCDA204': { 'x': 0, 'y': 0 },
      '2FCDA203': { 'x': 0, 'y': 0 },
      '2FCDA233': { 'x': 0, 'y': 0 },
      '2FCDA231': { 'x': 0, 'y': 0 },
      '2FCDA234': { 'x': 0, 'y': 0 },
      '2TCDA221': { 'x': 0, 'y': 0 },
      '2TCDA241': { 'x': 0, 'y': 0 },
      '2TCDA251': { 'x': 0, 'y': 0 },
      '2PRA221': { 'x': 0, 'y': 0 },
      '2PRCA241': { 'x': 0, 'y': 0 },
      '2PRCA251': { 'x': 0, 'y': 0 },
      '2FI0042': { 'x': 0, 'y': 0 }
    }
  },
  '39': {
    'name': '3-1-III聚丙烯', // 名称
    'group': '塑料板块',
    'gid': '39', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet39.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC111': { 'x': 0, 'y': 0 },
      'FIC201B': { 'x': 0, 'y': 0 },
      'FIC202B': { 'x': 0, 'y': 0 },
      'FIC402': { 'x': 0, 'y': 0 },
      'FIC221': { 'x': 0, 'y': 0 },
      'FIC203': { 'x': 0, 'y': 0 },
      'FIC233': { 'x': 0, 'y': 0 },
      'FIC231': { 'x': 0, 'y': 0 },
      'FIC234': { 'x': 0, 'y': 0 },
      'FIC404': { 'x': 0, 'y': 0 },
      'FIC403': { 'x': 0, 'y': 0 },
      'PIC221': { 'x': 0, 'y': 0 },
      'TIC221': { 'x': 0, 'y': 0 },
      'TIC241': { 'x': 0, 'y': 0 },
      'TIC251': { 'x': 0, 'y': 0 },
      'TIC401': { 'x': 0, 'y': 0 },
      'PIC241': { 'x': 0, 'y': 0 },
      'PIC251': { 'x': 0, 'y': 0 },
      'PIC402': { 'x': 0, 'y': 0 }
    }
  },
  '40': {
    'name': '4-0-加氢', // 名称
    'group': '纤维板块',
    'gid': '40', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet40.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC2201': { 'x': 0, 'y': 0 },
      'WICQ2101': { 'x': 0, 'y': 0 },
      'FIC2202': { 'x': 0, 'y': 0 },
      'PICZ2201': { 'x': 0, 'y': 0 },
      'TM221002': { 'x': 0, 'y': 0 }
    }
  },
  '41': {
    'name': '4-0-氧化装置', // 名称
    'group': '纤维板块',
    'gid': '41', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet41.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'FIC1101': { 'x': 109, 'y': 259 },
      'FIC1102': { 'x': 109, 'y': 329 },
      'PI1201': { 'x': 256, 'y': 105 },
      'TM121009': { 'x': 182, 'y': 189 },
      'FI1201': { 'x': 125, 'y': 577 },
      'FI1202': { 'x': 466, 'y': 337 }
    }
  },
  '42': {
    'name': '4-1-I聚酯', // 名称
    'group': '纤维板块',
    'gid': '42', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet42.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'IN01101A': { 'x': 262, 'y': 227 },
      'FIC01164A': { 'x': 934, 'y': 234 },
      'TIC02103': { 'x': 121, 'y': 414 },
      'PIC02106': { 'x': 295, 'y': 319 },
      'TIC13114': { 'x': 598, 'y': 360 },
      'PIC13111': { 'x': 778, 'y': 370 },
      'PIC13210': { 'x': 970, 'y': 467 },
      'TIC13212': { 'x': 978, 'y': 335 },
      'SIC02112': { 'x': 354, 'y': 550 },
      'TIC02128': { 'x': 384, 'y': 461 },
      'PIC15305': { 'x': 613, 'y': 421 },
      'TIC13112': { 'x': 749, 'y': 482 },
      'SIC13408A': { 'x': 1108, 'y': 396 }
    }
  },
  '43': {
    'name': '4-1-II聚酯1线', // 名称
    'group': '纤维板块',
    'gid': '43', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet43.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'T2101_AIN': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI7_1': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 },
      'MI7_2': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 }
    }
  },
  '44': {
    'name': '4-1-II聚酯2线', // 名称
    'group': '纤维板块',
    'gid': '44', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet44.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'MI1': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI1_6': { 'x': 0, 'y': 0 },
      'MI7': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 }
    }
  },
  '45': {
    'name': '4-1-II聚酯3线', // 名称
    'group': '纤维板块',
    'gid': '45', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet45.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'MI1': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI1_6': { 'x': 0, 'y': 0 },
      'MI7': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 },
      'MI7_2': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 }
    }
  },
  '46': {
    'name': '4-1-II聚酯4线', // 名称
    'group': '纤维板块',
    'gid': '46', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet46.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'MI1': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI1_6': { 'x': 0, 'y': 0 },
      'MI7': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 },
      'MI7_2': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 }
    }
  },
  '47': {
    'name': '4-1-II聚酯5线', // 名称
    'group': '纤维板块',
    'gid': '47', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet47.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'MI1': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI1_6': { 'x': 0, 'y': 0 },
      'MI7': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 },
      'MI7_2': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 }
    }
  },
  '48': {
    'name': '4-1-II聚酯6线', // 名称
    'group': '纤维板块',
    'gid': '48', // 接口对应的id
    'bgImage': './static/image/simulation/flowsheet48.jpg', // 背景图
    'bgColor': '#000', // 背景颜色
    // "width":"1114",
    // "height":"508",
    'padding': 20,
    'items': { // 测点名称及对应的位置
      'F1202_AIN': { 'x': 0, 'y': 0 },
      'PTAEGSPEED': { 'x': 0, 'y': 0 },
      'T2101_AIN': { 'x': 0, 'y': 0 },
      'P2101_AIN': { 'x': 0, 'y': 0 },
      'MI1_6': { 'x': 0, 'y': 0 },
      'MI7': { 'x': 0, 'y': 0 },
      'P3101_AIN': { 'x': 0, 'y': 0 },
      'MI7_2': { 'x': 0, 'y': 0 },
      'P3201_AIN': { 'x': 0, 'y': 0 },
      'MI9': { 'x': 0, 'y': 0 },
      'P3301_AIN': { 'x': 0, 'y': 0 }
    }
  }
}
